presentacion/examples/soap/protected.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="http://www.ejemplo.com/calculadora.wsdl"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   
   <soapenv:Header>
      <wsse:Security>
         <wsse:BinarySecurityToken>
            MIIDSTCCAjGgAwIBAgIBBzANBgkqhkiG9w0BAQsFAD...
         </wsse:BinarySecurityToken>
      </wsse:Security>
   </soapenv:Header>
   
   <soapenv:Body>
      <tns:Sumar>
         <a>50</a>
         <b>
            <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
               <xenc:CipherData>
                  <xenc:CipherValue>A7b9kL2pQ==</xenc:CipherValue> 
               </xenc:CipherData>
            </xenc:EncryptedData>
         </b>
      </tns:Sumar>
   </soapenv:Body>
   
</soapenv:Envelope>